class ButtonName:
    TO_MAIN_MENU = 'Вернуться к главному меню'
    SCHEDULE = 'Расписание игр'
    HOW_TO = 'Как начать играть в страйкбол'
    MARKET = 'Барахолка'
    CALENDAR = 'Просмотр календаря'
    FILTERS = 'Просмотр по фильтрам'
    ORGANISERS = 'Организаторам'
    GO_BACK = '◀️'
    GENRES = 'Просмотр по жанрам'
    GROUPS = 'Просмотр по орг.группам'
    PLACES = 'Просмотр по полигонам'
    LONELINESS = 'Подходит ли для одиночек'
    NEW_GAME = 'Внесение новой игры'
    UPDATE_GAME = 'Редактирование существующей игры'
    SET_ADMIN = 'Назначить организатора'

    