class MessageText:
    HELLO = 'Привет, друг! Это бот для организации матчей по страйкболу. Выбери нужную опцию, чтобы узнать больше!'
    CHOOSE_FUNCTION = 'Выберите функцию:'
    MARKET = 'Барахолка и форум находятся в разработке. Следите за новостями!'
    HOW_TO = 'Как начать играггргргргргргргрг' # поменяй потом только
    ORGANISER_APPLICATION = 'Чтобы получить статус организатора, пришлите свой дикпик сюда:' + '\n' + '@balt_media'
    PRINT_DATETIME = 'Введите дату и время в формате "ДД-ММ-ГГГГ ЧЧ:ММ":'
    CHOOSE_GENRE = 'Выберите жанр:'
    CHOOSE_GROUP = 'Выберите орг.группу:'
    CHOOSE_PLACE = 'Выберите полигон:'
