class MessageText:
    HELLO = 'Привет, друг! Это бот для организации матчей по страйкболу. Выбери нужную опцию, чтобы узнать больше!'
    CHOOSE_FUNCTION = 'Выберите функцию:'
    MARKET = 'Барахолка и форум находятся в разработке. Следите за новостями!'
    HOW_TO = 'О том, как начать играть, вы можете узнать по ссылке:' + '\n' + '<место для ссылки>' #'https://www.youtube.com/watch?v=-LhUOF3XxBA' поменяй потом только
    ORGANISER_APPLICATION = 'Чтобы получить статус организатора, пришлите свой дикпик сюда:' + '\n' + '@balt_media'
    SET_DATETIME = 'Введите дату и время в формате "ДД-ММ-ГГГГ ЧЧ:ММ":'
    CHOOSE_GENRE = 'Выберите жанр:'
    CHOOSE_GROUP = 'Выберите орг.группу:'
    CHOOSE_PLACE = 'Выберите полигон:'
    CALENDAR = 'Календарь на стадии разработки'
    FILTERS = 'Выберите фильтр:'
